public/font-el.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2019-09-05 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Emacs Font Config</title>
<meta name="generator" content="Org mode">
<meta name="author" content="Mike Hostetler">
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/styles/readtheorg/css/readtheorg.css"/>
<link rel="icon" type="image/x-icon" href="/favicon.ico" />
<link rel="stylesheet" href="style.css" type="text/css">
</head>
<body>
<main id="content">
<header>
<h1 class="title">Emacs Font Config</h1>
</header><nav id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org672eb8f">Prologue</a></li>
<li><a href="#orgce0d802">Unicode</a></li>
<li><a href="#org2915ce9">Font selection</a>
<ul>
<li><a href="#orgef9cfb9">Let&rsquo;s get complicated</a></li>
</ul>
</li>
<li><a href="#orge008a13">Lastly&#x2026; more Unicode</a></li>
</ul>
</div>
</nav>

<section id="outline-container-org672eb8f" class="outline-2">
<h2 id="org672eb8f">Prologue</h2>
<div class="outline-text-2" id="text-org672eb8f">
<p>
Generally fonts on the web or in applications aren&rsquo;t a big deal, but some reason I spend a lot of time finding an tweaking fonts in my editor. This is a story of how I set that up.
</p>
</div>
</section>

<section id="outline-container-orgce0d802" class="outline-2">
<h2 id="orgce0d802">Unicode</h2>
<div class="outline-text-2" id="text-orgce0d802">
<p>
First and really the most important &#x2013; set UTF-8 everywhere
</p>

<div class="org-src-container">
<pre class="src src-lisp">(set-language-environment <span class="org-string">"UTF-8"</span>)
(set-default-coding-systems 'utf-8-unix)

</pre>
</div>
</div>
</section>

<section id="outline-container-org2915ce9" class="outline-2">
<h2 id="org2915ce9">Font selection</h2>
<div class="outline-text-2" id="text-org2915ce9">
<p>
I got back and forth of what I want for a default font. And once in a while I have to move this config to other machines and they may not have all my configs. So below you can see what I have tried&#x2026; none of these are bad, but I&rsquo;ve moved for some reason.
</p>

<p>
Basically this little snippet will look if that font name exists and, if so, will set it as the default. Note that I do this over and over again, replacing the default font until it gets to the end.
</p>

<p>
<a href="https://dejavu-fonts.github.io/">DejaVu Sans Mono</a>
</p>


<div class="org-src-container">
<pre class="src src-lisp">(<span class="org-keyword">when</span> (member <span class="org-string">"DejaVu Sans Mono"</span> (font-family-list))
  (set-face-attribute 'default nil <span class="org-builtin">:font</span> <span class="org-string">"DejaVu Sans Mono"</span> <span class="org-builtin">:height</span> 140 <span class="org-builtin">:weight</span> 'normal))

</pre>
</div>

<p>
<a href="https://github.com/adobe-fonts/source-code-pro">Source Code Pro</a> &#x2013; I used this the longest. One of it&rsquo;s problems is that it doesn&rsquo;t have all the unicode characters in it (see below of that fix). Another is that it&rsquo;s hard to read sometimes, and making it bigger can make it worse. I like it at 125 and really no other size
</p>

<div class="org-src-container">
<pre class="src src-lisp">(<span class="org-keyword">when</span> (member <span class="org-string">"Source Code Pro"</span> (font-family-list))
  (set-face-attribute 'default nil <span class="org-builtin">:font</span> <span class="org-string">"Source Code Pro"</span> <span class="org-builtin">:height</span> 125 <span class="org-builtin">:weight</span> 'normal))

</pre>
</div>

<p>
<a href="https://github.com/IBM/plex">IBM Plex</a> &#x2013; wait? IBM has a font?!? Yes it does. Lots of them, actually, under the Plex name. It&rsquo;s certainly very corporate looking, but apparently they use this corporate wide. Not only does it look nice and scale well, it seems to be complete as far as weight, italic, etc. Anyway this is my latest font try and so far so good.
</p>

<div class="org-src-container">
<pre class="src src-lisp">(<span class="org-keyword">when</span> (member <span class="org-string">"IBM Plex Mono"</span> (font-family-list))
  (set-face-attribute 'default nil <span class="org-builtin">:font</span> <span class="org-string">"IBM Plex Mono"</span> <span class="org-builtin">:height</span> 135 <span class="org-builtin">:weight</span> 'normal))

</pre>
</div>
</div>

<div id="outline-container-orgef9cfb9" class="outline-3">
<h3 id="orgef9cfb9">Let&rsquo;s get complicated</h3>
<div class="outline-text-3" id="text-orgef9cfb9">
<p>
Sometimes in writing, I may want to use a Sans-Serif font&#x2026; this function will let me do that
</p>

<div class="org-src-container">
<pre class="src src-lisp">(<span class="org-keyword">defun</span> <span class="org-function-name">mikeh-buffer-face-mode-sans</span> ()
  <span class="org-doc">"Sets a sans-serif font in current buffer"</span>
  (interactive)
  (setq buffer-face-mode-face '(<span class="org-builtin">:family</span> <span class="org-string">"IBM Plex Arabic"</span> <span class="org-builtin">:height</span> 135 <span class="org-builtin">:weight</span> 'normal))
  (buffer-face-mode))

</pre>
</div>
</div>
</div>
</section>
<section id="outline-container-orge008a13" class="outline-2">
<h2 id="orge008a13">Lastly&#x2026; more Unicode</h2>
<div class="outline-text-2" id="text-orge008a13">
<p>
Seems familiar? Just like <a href="#orgce0d802">in Unicode</a> but different &#x2013; that was about what we use, not what we display it. Symbola is pretty ugly but (as the name states) it has a complete UTF-8 state. Prepending this allows us to view all characters.
</p>

<p>
I should note that I don&rsquo;t deal with multiple languages and symbols often, but it&rsquo;s best to prepare yourself when before you find yourself in that world
</p>

<div class="org-src-container">
<pre class="src src-lisp">(<span class="org-keyword">when</span> (member <span class="org-string">"Symbola"</span> (font-family-list))
  (set-fontset-font t 'unicode <span class="org-string">"Symbola"</span> nil 'prepend))

</pre>
</div>
</div>
</section>
</main>
<footer id="postamble" class="status">
<hr>
<p>
<p class="Source">Source: <a href="https://github.com/squarepegsys/literate-dotfiles/blob/master/font-el.org">font-el.org</a></p><p>Return to <a href="index.html">index</a>.</p>
</footer>
</body>
</html>
